Repository: sonority/lib_js_analytics
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# settings.enable
source: Enable: Enable this if you want to include google-analytics on your site.
de: Aktivieren: Aktivieren Sie diese Option, wenn Google Analytics in Ihrer Website eingebunden werden soll.

# settings.trackingId
source: Tracking ID / Web Property ID: The tracking ID / web property ID. The format is UA-XXXX-Y. All collected data is associated by this ID.
de: Tracking ID / Web Property ID: Die Tracking ID / Web Property ID. Das Format ist UA-XXXX-Y. Die gesammelten Daten werden mit dieser ID verknüpft.

# settings.name
source: Tracker Name: Name of the tracker object (optional).
de: Tracker-Name: Name des Tracker-Objektes (optional).

# settings.anonymizeIp
source: Anonymize IP: When present, the IP address of the sender will be anonymized.
de: Anonymisiere IP-Adresse: Wenn aktiviert, wird die IP-Adresse des Benutzers anonymisiert erfasst.

# settings.pageExclude
source: Page exclude: Set page-IDs (commaseparated list) where the tracking code should not be used.
de: Ausschluss von Seiten: Tragen Sie hier die Seiten-IDs der Seiten ein, an denen der Tracking-Code nicht verwendet werden soll.

# settings.forceCdn
source: Force CDN: Force the use of the external analytics-script from Google's CDN.
de: Erzwinge CDN: Erzwinge die Verwendung des externen analytics-Skript von Google's CDN, anstatt der lokalen Kopie.

# settings.disableIfBeUserLogin
source: Disable if BE-session is active: Enable this if you want to include the script only if there is no backend-user logged in (Be aware that this will add the condition 'beUserLogin' which will influence site-caching!).
de: Deaktivieren bei BE-Session: Aktivieren Sie diese Option, wenn das Script nur eingebunden werden soll falls kein Backend-Benutzer eingeloggt ist (Beachten Sie, dass dabei die Condition 'beUserLogin' hinzugefügt wird, was unter Umständen das Caching der Website beeinflusst).

# settings.alternative
source: Use alternative script: Enables alternative async tracking snippet for use in modern browsers (see: https://developers.google.com/analytics/devguides/collection/analyticsjs/).
de: Verwende alternatives Script: Aktivieren Sie diese Option um die Einbindung des alternativen Tracking-Snippets für die Verwendung in modernen Browser zu aktivieren (siehe: https://developers.google.com/analytics/devguides/collection/analyticsjs/).

# settings.gaObjectName
source: Name of the GA-object: In some cases you'd like to add analytics.js to your page, but the 'ga' variable is already being used for something else. To deal with this, analytics.js provides a mechanism for renaming the global 'ga' object.
de: Name des GA-Objektes: In manchen Fällen ist es notwendig die 'ga'-Variable umzubenennen, weil diese schon von einem anderen Mechanismus verwendet wird. In diesem Fall geben Sie hier den Namem des Objektes an.

# settings.gaCookieConsent
source: Script-Tag for Cookie Consent: To use this extension with cookie consent, enter a script-tag here which will be added as "data-SCRIPTTAG". If not empty, all external scripts are added with "data-src" instead of "src".
de: Script-Tag für Cookie Consent: Um diese Extension mit Cookie Consent zu verwenden, geben Sie hier einen Script-Tag an welcher als "data-SCRIPTTAG" hinzugefügt wird. Wenn nicht leer, werden alle externen Scripte mit "data-src" hinzugefügt, statt mit "src".

# extmgm.sourceFile
source: URL to Google-Analytics: URL to Google-Analytics javascript (analytics.js)
de: URL zu Google-Analytics: URL to Google-Analytics javascript (analytics.js)

# extmgm.localFile
source: Local javascript-file: Path to the local javascript-file of Google-Analytics (relative to PATH_site)
de: Lokale Javascript-Datei: Pfad zur lokalen Javascript-Datei von Google-Analytics (Relativ zu PATH_site).

# extmgm.forceExternal
source: Force external file: Enable this if you want to force the use of the original file from Google's CDN.
de: Erzwinge externe Datei: Wenn aktiviert, wird die Verwendung der originalen Datein von Google's CDN erzwungen.

# task.update.title
source: Update analytics.js from Google's CDN
de: Aktualisiere analytics.js von Google's CDN

# task.update.description
source: Update the Google-Analytics JavaScript tracking snippet.
de: Aktualisiere das Google-Analytics JavaScript tracking snippet.

# tools.getContentFromSourceFile.404
source: Sourcefile %s could not be downloaded (Error 404).
de: Quelldatei %s konnte nicht herunter geladen werden (Fehler 404).

# tools.getContentFromSourceFile.wrongType
source: Successfully downloaded content from %s, but the response was not of type 'text/javascript'.
de: Erfolgreicher Download von %s, aber die Rückmeldung war nicht vom Typ 'text/javascript'.

# tools.getContentFromSourceFile.emptyFile
source: Successfully downloaded %s, but the result was empty.
de: Erfolgreicher Download von %s, aber die Datei ist leer.

# tools.getContentFromSourceFile.error
source: Failed to download %s. %s
de: Fehler beim Download von %s. %s

# tools.writeJavascriptFile.success
source: Content of %s was successfully saved to '%s'.
de: Inhalt von %s wurde erfolgreich nach '%s' gespeichert.

# tools.writeJavascriptFile.writeError
source: This is serious: the file '%s' could not be written to the filesystem.
de: Das scheint ernst zu sein: Die Datei '%s' konnte nicht ins Dateisystem geschrieben werden.
